print('')
print('====================================================================================================')
print('== 문제 111. 숫자를 물어보게하고 숫자를 입력해서 짝수인지 홀수인지를 출력하는 if 문을 이용한 파이썬 코드를 작성하시오!')
print('====================================================================================================')
a = int(input('숫자를 입력하세요 : '))

print('짝수') if a % 2 == 0 else print('홀수')


print('')
print('====================================================================================================')
print('== 문제 113. 이름을 물어보게하고 이름을 입력하면 해당 사원이 고소득자인지 저소득자인지 출력되게하시오!')
print('====================================================================================================')
import pandas as pd
ename = input('이름을 입력하세요 : ')
empData = pd.read_csv('C:\\data\\emp.csv')
sal = empData[['sal']][empData['ename'] == ename].values[0]

if sal >= 3000:
    print('고소득자 입니다.')
elif sal >= 2000:
    print('적당합니다.')
else:
    print('저소득자입니다.')


print('')
print('====================================================================================================')
print('== 문제 114. 위의 문제를 다시 수행하는데 소문자로 입력해도 가능하도록 하시오')
print('====================================================================================================')
import pandas as pd

ename = input('이름을 입력하세요 : ')
empData = pd.read_csv('C:\\data\\emp.csv')
sal = empData[['sal']][empData['ename'] == ename].values[0]

if sal >= 3000:
    print('고소득자 입니다.')
elif sal >= 2000:
    print('적당합니다.')
else:
    print('저소득자입니다.')

print('')
print('====================================================================================================')
print('== 문제 115. (알고리즘 문제) 가우스 공식으로 1부터 10까지의 숫자 합을 출력하시오')
print('====================================================================================================')

num1 = int(input('첫번째 숫자를 입력하세요'))
num2 = int(input('두번째 숫자를 입력하세요'))
sum = (num1 + num2)/2 * (num2-num1+1)
print(sum)


print('')
print('====================================================================================================')
print('== 문제 116. 위의 문제를 다시 수행하는데 큰 숫자를 먼저 입력하면 첫번째 입력한 숫자가 두번째 입력한 숫자보다 큽니다.라는 메시지를 출력')
print('====================================================================================================')

num1 = int(input('첫번째 숫자를 입력하세요'))
num2 = int(input('두번째 숫자를 입력하세요'))
if num1 > num2:
    print('첫번째 입력한 숫자가 두번째 입력한 숫자보다 큽니다')
else:
    sum = (num1 + num2)/2 * (num2-num1+1)
    print(sum)

for i in range(5):
    print(i)

for i in range(1, 10, 2):
    print(i)


print('')
print('====================================================================================================')
print('== 문제 117. 구구단 2단을 출력')
print('====================================================================================================')

for i in range(2,10):
    for j in range(1,10):
        print(i,'X',j,'=',i*j,'입니다')
    print('\n')


print('')
print('====================================================================================================')
print('== 문제 118. 아래의 결과를 출력')
print('====================================================================================================')
for i in range(1,11):
        print('*'*i)


print('')
print('====================================================================================================')
print('== 문제 119. 위의 결과를 반대로 출력')
print('====================================================================================================')
for i in range(1,11):
        print('*'*(11-i))


print('')
print('====================================================================================================')
print('== 문제 120. 마름모 모양으로 출력')
print('====================================================================================================')

for i in range(1,5):
    for j in range(1,2):
        print(' '*(6-i),'★' * i)
for i in range(1,6):
    for j in range(1,2):
        print(' '*i,'★' *(6-i))

#문제 140. emp와 dept라는 딕셔너리 자료 구조를 만드는 스크립트와 중첩 for loop문을 이용해서 emp와 dept를 조인시켜서
# ename과 loc를 출력하시오

import csv

file = open("C:\data\dept.csv",'r')
dept= []
dept_csv =csv.reader(file)
for i in dept_csv:
    dept.append({'deptno':i[0],'dname':i[1],'loc' : i[2]})
print(dept)

for dept_dic in dept:
    print(dept_dic['deptno'],dept_dic['dname'],dept_dic['loc'])
for e in emp: # 14건이므로 14번 loop.
    for d in dept: #4건이므로 14번에 대해서 각각 4번씩 loop 돈다.
        if e['deptno'] == d['deptno']:
            print(e['ename'], d['loc'])

## " nested loop:

#문제 141. 부서위치가 DALLAS인 사원들의 이름과 부서위치를 출력하시오
import csv

file = open("C:\data\dept.csv",'r')

for e in emp: # 14건이므로 14번 loop.
    for d in dept: #4건이므로 14번에 대해서 각각 4번씩 loop 돈다.
        if e['deptno'] == d['deptno']:
        if d['loc'] == 'DALLAS':
            print(e['ename'], d['loc'])

#문제 148. 함수 f(x) = x 